In [1]:
from pydataset import data

In [2]:
import pandas as pd
import numpy as np

In [3]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [4]:
print(df)

       name  math  english  reading
0     Sally    62       85       80
1      Jane    88       79       67
2     Suzie    94       74       95
3     Billy    98       96       88
4       Ada    77       92       98
5      John    79       76       93
6    Thomas    82       64       81
7     Marie    93       63       90
8    Albert    92       62       87
9   Richard    69       80       94
10    Isaac    92       99       93
11     Alan    92       62       72

# 1.Copy the code from the lesson to create a dataframe full of #student grades.

#    a. Create a column named passing_english that indicates #whether each student has a passing grade in english.

In [7]:
df['passing_english']= df.english >= 70

In [8]:
df

       name  math  english  reading  passing_english
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
9   Richard    69       80       94             True
10    Isaac    92       99       93             True
11     Alan    92       62       72            False

In [14]:
# 1b. Sort the english grades by the passing_english column. How are duplicates handled?
df.sort_values(by='passing_english')
df

       name  math  english  reading  passing_english
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
9   Richard    69       80       94             True
10    Isaac    92       99       93             True
11     Alan    92       62       72            False

In [13]:
# 1c. Sort the english grades first by passing_english and then by student name. All the 
#students that are failing english should be first, and within the students that are failing 
#english they should be ordered alphabetically. The same should be true for the students 
#passing english. (Hint: you can pass a list to the .sort_values method)

df.sort_values(by=['passing_english','name'])

       name  math  english  reading  passing_english
11     Alan    92       62       72            False
8    Albert    92       62       87            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True
1      Jane    88       79       67             True
5      John    79       76       93             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
2     Suzie    94       74       95             True

In [ ]:
df.sort_values(by='english < 70').sort_values(by='passing_english').name

In [ ]:
# 1d. Sort the english grades first by passing_english, and then by the actual english 
#grade, similar to how we did in the last step.

df.sort_values(by='passing_english').sort_values(by='english')

In [ ]:
# 1e. Calculate each students overall grade and add it as a column on the dataframe. 
#The overall grade is the average of the math, english, and reading grades.

df['overall_grade'] = df.mean()
df

In [ ]:
# 2. Load the mpg dataset. Read the documentation for the dataset and use it for the 
#following questions:

mpg = data('mpg')

In [ ]:
# 2a.How many rows and columns are there?
print(mpg)
# 234 rows x 11 columns

In [ ]:
# 2b. What are the data types of each column?
mpg.dtypes

In [ ]:
# 2c. Summarize the dataframe with .info and .describe
mpg.info()

In [ ]:
# 2c. Summarize the dataframe with .info and .describe
mpg.describe()

In [ ]:
# 2d. Rename the cty column to city.
mpg.rename(columns={'cty': 'city'})

In [ ]:
# 2e. Rename the hwy column to highway.
mpg.rename(columns={'hwy': 'highway'}).rename(columns={'cty' : 'city'})

In [ ]:
# 2f. Do any cars have better city mileage than highway mileage?
mpg['better_mileage'] = mpg['cty'] > mpg['hwy']
mpg

In [ ]:
# 2g. Create a column named mileage_difference this column should contain the difference 
#between highway and city mileage for each car.
mpg['mileage_difference'] = mpg.hwy - mpg.cty
mpg

In [ ]:
# 2h. Which car (or cars) has the highest mileage difference?

In [ ]:
# 2i. Which compact class car has the lowest highway mileage? The best?

In [ ]:
# 2j. Create a column named average_mileage that is the mean of the city and highway mileage.

In [ ]:
# 2k. Which dodge car has the best average mileage? The worst?

In [ ]:
# 3. Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:

In [ ]:
# 3a. How many rows and columns are there?

In [ ]:
# 3b. What are the data types?

In [ ]:
# 3c. Summarize the dataframe with .info and .describe

In [ ]:
# 3d. What is the the weight of the fastest animal?

In [ ]:
# 3e. What is the overal percentage of specials?

In [ ]:
# 3f. How many animals are hoppers that are above the median speed? What percentage is this?